Tekla.Structures.Internal.RemotingProxyHelper
Helper class for remoting proxies that serve activated client type objects as singleton instances.
This is an example implementation of the remoting proxy for RemoteType type.
using System;
using Tekla.Structures.Internal;
namespace Tekla.Structures.MyProject
{
public interface IRemoteType
{
// Implementation omitted
}
public sealed class RemoteType : MarshalByRefObject, IRemoteType
{
// Implementation omitted
}
public sealed class RemoteTypeProxy
{
private static IRemoteType _Instance;
static RemoteTypeProxy()
{
string appUrl = "ipc://ApplicationName";
RemoteTypeProxy._Instance = RemotingProxyHelper.CreateInstance<RemoteType>(appUrl);
}
public static IRemoteType Instance
{
get
{
RemotingProxyHelper.TestInstance(RemoteTypeProxy._Instance);
return RemoteTypeProxy._Instance;
}
}
}
}

Tekla.Structures.Internal.RemotingProxyHelper.IsFormWrapperRequired
Checks if the FormWrapperFunctionality needs to be used with the current process and thread.
Returns: true if FormWrapperFunctionality is required; otherwise false.

Tekla.Structures.Internal.RemotingProxyHelper.SetRemotingProxyFactory(Tekla.Structures.Internal.RemotingProxyFactory)
Call SetRemotingProxyFactory once.
factory: Factory

Tekla.Structures.Internal.RemotingProxyHelper.CreateInstance``1(System.String)
Creates an instance of the remote object. If necessary the object type is
registered as activated client type before it is created. The created instance
is also sponsored if necessary.
This method should be called only once per type. Subsequent calls may throw an exception.
appUrl:
URL of the application where this type is activated.

Tekla.Structures.Internal.RemotingProxyHelper.TestInstance(System.Object)
Checks that the type of the given instance has not been registered as
activated client type after the instance was instantiated.

Tekla.Structures.Internal.RemotingProxyHelper.InitializeChannels
Instantiates and registers client and server channels for remoting.